# Напишите код, который берёт цифру 7, 
# умножает саму на себя же 5 раз.
res = 7
for i in range(5):
    res *= 7
    print(res)