# Напишите код, который выведет на экран список языков с нумерацией.
languages = ['go', 'java', 'php', 'python', 'javascript', 'ruby']
n = 0
for i in languages:
    print(n,i)
    n+=1