# Создать Tuple из 3 элементов и вывести каждый из них по индексу.
tuple1 = 1,2,3
print(tuple1[0],tuple1[1],tuple1[2])