# Создать Лист и заполнить его 5 РАЗНЫМИ ТИПАМИ ДАННЫХ.
list1 = [123,123.0,"qwer",bool,[1,2]]
for i in list1:
    print(type(i), '-', i)