# Создать Tuple из 15 различных объектов.
# Разрезать Tuple
# на 5 строк по 3 объекта в строке.
tuple1 = (0,1,2,3,4,5,6,7,8,9,10,11,12,13,14)
print(tuple1[:3])
print(tuple1[3:6])
print(tuple1[6:9])
print(tuple1[9:12])
print(tuple1[12:15])