# Написать lambda которая принимает 
# 3 параметра и умножает все параметры 
# между собой. Функция должна вернуть 
# строку: "Объём бассейна " и значение 
# которое получилось.
zad1 = lambda h, w, d:f'Объем бассейна {h * w * d} м^3'
print(zad1(2,3,4))