# Напишите код где есть TypeError,IndexError,NameError.
num = input('Введите число: ')
if num > 5:         # TypeError
    print('Что то')
list1 = [1,2,3,4]   # IndexError
print(list1[6])
# print(q)            # NameError