# Создайте 2 переменные 
# со значениями 2**3 и 
# 3**2 и покажите значение
# переменной в которой
# значение больше.
a = 2**3
b = 3**2
if a > b:
    print("a > b")
elif a == b:
    print("a == b")
else:
    print("b > a")