# Напишите условие, которое выводит
# отрицательные числа
a = int(input('Введите число: '))
if a < 0:
    print(a)
else:
    print("Число положительное")