# У вас есть переменные a=10 и b=5
# Напишите условие которое проверяет,
# являются ли ваши переменные положительными
# числами(только один if)
a = 10
b = 5
if a > 0 and b > 0:
    print("Они положительные")
    