# Создайте SET из 5 элементов. 
# Потом добавьте в SET ещё один элемент.
# А затем удалите через .pop() элемент и 
# посмотрите что же вы удалили.
set1 = {1,2,3,4,5}
set1.add(10)
set1.pop()
print(set1)